GopalSaraf/Practicals/PSDL/include/proc/pic16f18854.inc
// Register: CCDNC
#define CCDNC CCDNC
CCDNC                                    equ 0F56h
// bitfield definitions
CCDNC_CCDNC0_POSN                        equ 0000h
CCDNC_CCDNC0_POSITION                    equ 0000h
CCDNC_CCDNC0_SIZE                        equ 0001h
CCDNC_CCDNC0_LENGTH                      equ 0001h
CCDNC_CCDNC0_MASK                        equ 0001h
CCDNC_CCDNC1_POSN                        equ 0001h
CCDNC_CCDNC1_POSITION                    equ 0001h
CCDNC_CCDNC1_SIZE                        equ 0001h
CCDNC_CCDNC1_LENGTH                      equ 0001h
CCDNC_CCDNC1_MASK                        equ 0002h
CCDNC_CCDNC2_POSN                        equ 0002h
CCDNC_CCDNC2_POSITION                    equ 0002h
CCDNC_CCDNC2_SIZE                        equ 0001h
CCDNC_CCDNC2_LENGTH                      equ 0001h
CCDNC_CCDNC2_MASK                        equ 0004h
CCDNC_CCDNC3_POSN                        equ 0003h
CCDNC_CCDNC3_POSITION                    equ 0003h
CCDNC_CCDNC3_SIZE                        equ 0001h
CCDNC_CCDNC3_LENGTH                      equ 0001h
CCDNC_CCDNC3_MASK                        equ 0008h
CCDNC_CCDNC4_POSN                        equ 0004h
CCDNC_CCDNC4_POSITION                    equ 0004h
CCDNC_CCDNC4_SIZE                        equ 0001h
CCDNC_CCDNC4_LENGTH                      equ 0001h
CCDNC_CCDNC4_MASK                        equ 0010h
CCDNC_CCDNC5_POSN                        equ 0005h
CCDNC_CCDNC5_POSITION                    equ 0005h
CCDNC_CCDNC5_SIZE                        equ 0001h
CCDNC_CCDNC5_LENGTH                      equ 0001h
CCDNC_CCDNC5_MASK                        equ 0020h
CCDNC_CCDNC6_POSN                        equ 0006h
CCDNC_CCDNC6_POSITION                    equ 0006h
CCDNC_CCDNC6_SIZE                        equ 0001h
CCDNC_CCDNC6_LENGTH                      equ 0001h
CCDNC_CCDNC6_MASK                        equ 0040h
CCDNC_CCDNC7_POSN                        equ 0007h
CCDNC_CCDNC7_POSITION                    equ 0007h
CCDNC_CCDNC7_SIZE                        equ 0001h
CCDNC_CCDNC7_LENGTH                      equ 0001h
CCDNC_CCDNC7_MASK                        equ 0080h

// Register: CCDPC
#define CCDPC CCDPC
CCDPC                                    equ 0F57h
// bitfield definitions
CCDPC_CCDPC0_POSN                        equ 0000h
CCDPC_CCDPC0_POSITION                    equ 0000h
CCDPC_CCDPC0_SIZE                        equ 0001h
CCDPC_CCDPC0_LENGTH                      equ 0001h
CCDPC_CCDPC0_MASK                        equ 0001h
CCDPC_CCDPC1_POSN                        equ 0001h
CCDPC_CCDPC1_POSITION                    equ 0001h
CCDPC_CCDPC1_SIZE                        equ 0001h
CCDPC_CCDPC1_LENGTH                      equ 0001h
CCDPC_CCDPC1_MASK                        equ 0002h
CCDPC_CCDPC2_POSN                        equ 0002h
CCDPC_CCDPC2_POSITION                    equ 0002h
CCDPC_CCDPC2_SIZE                        equ 0001h
CCDPC_CCDPC2_LENGTH                      equ 0001h
CCDPC_CCDPC2_MASK                        equ 0004h
CCDPC_CCDPC3_POSN                        equ 0003h
CCDPC_CCDPC3_POSITION                    equ 0003h
CCDPC_CCDPC3_SIZE                        equ 0001h
CCDPC_CCDPC3_LENGTH                      equ 0001h
CCDPC_CCDPC3_MASK                        equ 0008h
CCDPC_CCDPC4_POSN                        equ 0004h
CCDPC_CCDPC4_POSITION                    equ 0004h
CCDPC_CCDPC4_SIZE                        equ 0001h
CCDPC_CCDPC4_LENGTH                      equ 0001h
CCDPC_CCDPC4_MASK                        equ 0010h
CCDPC_CCDPC5_POSN                        equ 0005h
CCDPC_CCDPC5_POSITION                    equ 0005h
CCDPC_CCDPC5_SIZE                        equ 0001h
CCDPC_CCDPC5_LENGTH                      equ 0001h
CCDPC_CCDPC5_MASK                        equ 0020h
CCDPC_CCDPC6_POSN                        equ 0006h
CCDPC_CCDPC6_POSITION                    equ 0006h
CCDPC_CCDPC6_SIZE                        equ 0001h
CCDPC_CCDPC6_LENGTH                      equ 0001h
CCDPC_CCDPC6_MASK                        equ 0040h
CCDPC_CCDPC7_POSN                        equ 0007h
CCDPC_CCDPC7_POSITION                    equ 0007h
CCDPC_CCDPC7_SIZE                        equ 0001h
CCDPC_CCDPC7_LENGTH                      equ 0001h
CCDPC_CCDPC7_MASK                        equ 0080h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 0F65h
// bitfield definitions
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 0F68h
// bitfield definitions
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 0F69h
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 0F6Ah
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 0F6Bh
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

